users-service/src/test.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
   xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
   xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" 
   xmlns:tns="http://tempuri.org/" 
   xmlns:msb="http://schemas.microsoft.com/ws/06/2004/mspolicy/netbinary1" 
   xmlns:msf="http://schemas.microsoft.com/ws/2006/05/framing/policy">
   <soap:Body>
      <RegisterCustomer xmlns="http://tempuri.org/">
         <licenseCode>PizzaHutApp</licenseCode>
         <language>ar</language>
         <customer>
            <q67:CUST_NOTIFICATION_MOBILE xmlns:q67="">971435268943</q67:CUST_NOTIFICATION_MOBILE>
            <q67:CUST_PHONEAREACODE xmlns:q67="">97</q67:CUST_PHONEAREACODE>
            <q67:CUST_PHONELOOKUP xmlns:q67="">971435268943</q67:CUST_PHONELOOKUP>
            <q67:CUST_PHONENUMBER xmlns:q67="">1435268943</q67:CUST_PHONENUMBER>
         </customer>
         <conceptID>3</conceptID>
      </RegisterCustomer>
   </soap:Body>
</soap:Envelope>